app/controllers/perks_controller.rb

SELECT * FROM "perks"
---
  def index
    @perks = Perk.all

SELECT * FROM "perks" WHERE ("perks"."id" = 0)
---
  def show
    @perk = Perk.find(params[:id])