app/controllers/task_users_controller.rb

  def index
    @task_users = TaskUser.all
---
SELECT * FROM "task_users"